Documents/СчетНаОплату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>СчетНаОплату</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаРаботу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗатратыВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗаказа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СчетНаОплату/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.СчетНаОплату.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетНаОплату.Дата КАК Дата,
	|	СчетНаОплату.Контрагент КАК Контрагент,
	|	СчетНаОплату.Номер КАК Номер,
	|	СчетНаОплату.Документы.(
	|		НомерСтроки КАК НомерСтроки,
	|		Заказ.Заголовок КАК Описание,
	|		Статус КАК Статус,
	|		ЗатратыВремени КАК ЗатратыВремени,
	|		СуммаЗаказа КАК СуммаЗаказа,
	|		Заказ.Комментарий КАК Комментарий
	|	) КАК Документы
	|ИЗ
	|	Документ.СчетНаОплату КАК СчетНаОплату
	|ГДЕ
	|	СчетНаОплату.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДокументыШапка = Макет.ПолучитьОбласть("ДокументыШапка");
	ОбластьДокументы = Макет.ПолучитьОбласть("Документы");
	ОбластьДокументыПодвал = Макет.ПолучитьОбласть("ДокументыПодвал");
	ТабДок.Очистить();

	Итого = 0;
	ИтогоВремя = 0;
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьЗаголовок.Параметры.Номер = Выборка.Номер;
		ОбластьЗаголовок.Параметры.Дата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьДокументыШапка);
		ВыборкаДокументы = Выборка.Документы.Выбрать();
		Пока ВыборкаДокументы.Следующий() Цикл
			ОбластьДокументы.Параметры.Заполнить(ВыборкаДокументы);
			Итого = Итого + ВыборкаДокументы.СуммаЗаказа;
			ИтогоВремя = ИтогоВремя + ВыборкаДокументы.ЗатратыВремени;
			ТабДок.Вывести(ОбластьДокументы, ВыборкаДокументы.Уровень());
		КонецЦикла;

		ОбластьДокументыПодвал.Параметры.Итого = Итого;
		ОбластьДокументыПодвал.Параметры.ИтогоВремя = ИтогоВремя;

		ТабДок.Вывести(ОбластьДокументыПодвал, ВыборкаДокументы.Уровень());
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
